feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* DAC1_OUT */
#define DAC1_OUT_PA4 AT32_PINMUX_AF('A', 4, ANALOG)

/* DAC2_OUT */
#define DAC2_OUT_PA5 AT32_PINMUX_AF('A', 5, ANALOG)

/* DVP_D0 */
#define DVP_D0_PA9 AT32_PINMUX_AF('A', 9, AF13)
#define DVP_D0_PC6 AT32_PINMUX_AF('C', 6, AF13)

/* DVP_D1 */
#define DVP_D1_PA10 AT32_PINMUX_AF('A', 10, AF13)
#define DVP_D1_PC7 AT32_PINMUX_AF('C', 7, AF13)

/* DVP_D10 */
#define DVP_D10_PB5 AT32_PINMUX_AF('B', 5, AF13)
#define DVP_D10_PD6 AT32_PINMUX_AF('D', 6, AF13)

/* DVP_D11 */
#define DVP_D11_PD2 AT32_PINMUX_AF('D', 2, AF13)
#define DVP_D11_PF10 AT32_PINMUX_AF('F', 10, AF13)

/* DVP_D12 */
#define DVP_D12_PF11 AT32_PINMUX_AF('F', 11, AF13)
#define DVP_D12_PG6 AT32_PINMUX_AF('G', 6, AF13)

/* DVP_D13 */
#define DVP_D13_PG15 AT32_PINMUX_AF('G', 15, AF13)
#define DVP_D13_PG7 AT32_PINMUX_AF('G', 7, AF13)

/* DVP_D2 */
#define DVP_D2_PA11 AT32_PINMUX_AF('A', 11, AF13)
#define DVP_D2_PC8 AT32_PINMUX_AF('C', 8, AF13)
#define DVP_D2_PE0 AT32_PINMUX_AF('E', 0, AF13)
#define DVP_D2_PG10 AT32_PINMUX_AF('G', 10, AF13)

/* DVP_D3 */
#define DVP_D3_PA12 AT32_PINMUX_AF('A', 12, AF13)
#define DVP_D3_PC9 AT32_PINMUX_AF('C', 9, AF13)
#define DVP_D3_PE1 AT32_PINMUX_AF('E', 1, AF13)
#define DVP_D3_PG11 AT32_PINMUX_AF('G', 11, AF13)

/* DVP_D4 */
#define DVP_D4_PB3 AT32_PINMUX_AF('B', 3, AF13)
#define DVP_D4_PC11 AT32_PINMUX_AF('C', 11, AF13)
#define DVP_D4_PE4 AT32_PINMUX_AF('E', 4, AF13)

/* DVP_D5 */
#define DVP_D5_PB4 AT32_PINMUX_AF('B', 4, AF13)
#define DVP_D5_PB6 AT32_PINMUX_AF('B', 6, AF13)
#define DVP_D5_PD3 AT32_PINMUX_AF('D', 3, AF13)

/* DVP_D6 */
#define DVP_D6_PB8 AT32_PINMUX_AF('B', 8, AF13)
#define DVP_D6_PE5 AT32_PINMUX_AF('E', 5, AF13)

/* DVP_D7 */
#define DVP_D7_PB9 AT32_PINMUX_AF('B', 9, AF13)
#define DVP_D7_PE6 AT32_PINMUX_AF('E', 6, AF13)

/* DVP_D8 */
#define DVP_D8_PC10 AT32_PINMUX_AF('C', 10, AF13)

/* DVP_D9 */
#define DVP_D9_PC12 AT32_PINMUX_AF('C', 12, AF13)
#define DVP_D9_PE3 AT32_PINMUX_AF('E', 3, AF13)

/* DVP_HSYNC */
#define DVP_HSYNC_PA4 AT32_PINMUX_AF('A', 4, AF13)

/* DVP_PIXCLK */
#define DVP_PIXCLK_PA6 AT32_PINMUX_AF('A', 6, AF13)

/* DVP_VSYNC */
#define DVP_VSYNC_PB7 AT32_PINMUX_AF('B', 7, AF13)
#define DVP_VSYNC_PG9 AT32_PINMUX_AF('G', 9, AF13)

/* EMAC_MDC */
#define EMAC_MDC_PC1 AT32_PINMUX_AF('C', 1, AF11)

/* EMAC_MDIO */
#define EMAC_MDIO_PA2 AT32_PINMUX_AF('A', 2, AF11)

/* EMAC_MII_COL */
#define EMAC_MII_COL_PA3 AT32_PINMUX_AF('A', 3, AF11)

/* EMAC_MII_CRS */
#define EMAC_MII_CRS_PA0 AT32_PINMUX_AF('A', 0, AF11)

/* EMAC_MII_RXD0 */
#define EMAC_MII_RXD0_PC4 AT32_PINMUX_AF('C', 4, AF11)
#define EMAC_MII_RXD0_PD9 AT32_PINMUX_AF('D', 9, AF11)

/* EMAC_MII_RXD1 */
#define EMAC_MII_RXD1_PC5 AT32_PINMUX_AF('C', 5, AF11)
#define EMAC_MII_RXD1_PD10 AT32_PINMUX_AF('D', 10, AF11)

/* EMAC_MII_RXD2 */
#define EMAC_MII_RXD2_PB0 AT32_PINMUX_AF('B', 0, AF11)
#define EMAC_MII_RXD2_PD11 AT32_PINMUX_AF('D', 11, AF11)

/* EMAC_MII_RXD3 */
#define EMAC_MII_RXD3_PB1 AT32_PINMUX_AF('B', 1, AF11)
#define EMAC_MII_RXD3_PD12 AT32_PINMUX_AF('D', 12, AF11)

/* EMAC_MII_RX_CLK */
#define EMAC_MII_RX_CLK_PA1 AT32_PINMUX_AF('A', 1, AF11)

/* EMAC_MII_RX_DV */
#define EMAC_MII_RX_DV_PA7 AT32_PINMUX_AF('A', 7, AF11)
#define EMAC_MII_RX_DV_PD8 AT32_PINMUX_AF('D', 8, AF11)

/* EMAC_MII_RX_ER */
#define EMAC_MII_RX_ER_PB10 AT32_PINMUX_AF('B', 10, AF11)

/* EMAC_MII_TXD0 */
#define EMAC_MII_TXD0_PB12 AT32_PINMUX_AF('B', 12, AF11)
#define EMAC_MII_TXD0_PG13 AT32_PINMUX_AF('G', 13, AF11)

/* EMAC_MII_TXD1 */
#define EMAC_MII_TXD1_PB13 AT32_PINMUX_AF('B', 13, AF11)
#define EMAC_MII_TXD1_PG14 AT32_PINMUX_AF('G', 14, AF11)

/* EMAC_MII_TXD2 */
#define EMAC_MII_TXD2_PC2 AT32_PINMUX_AF('C', 2, AF11)

/* EMAC_MII_TXD3 */
#define EMAC_MII_TXD3_PB8 AT32_PINMUX_AF('B', 8, AF11)
#define EMAC_MII_TXD3_PE2 AT32_PINMUX_AF('E', 2, AF11)

/* EMAC_MII_TX_CLK */
#define EMAC_MII_TX_CLK_PC3 AT32_PINMUX_AF('C', 3, AF11)

/* EMAC_MII_TX_EN */
#define EMAC_MII_TX_EN_PB11 AT32_PINMUX_AF('B', 11, AF11)
#define EMAC_MII_TX_EN_PG11 AT32_PINMUX_AF('G', 11, AF11)

/* EMAC_PPS_OUT */
#define EMAC_PPS_OUT_PB5 AT32_PINMUX_AF('B', 5, AF11)
#define EMAC_PPS_OUT_PG8 AT32_PINMUX_AF('G', 8, AF11)

/* EMAC_RMII_CRS_DV */
#define EMAC_RMII_CRS_DV_PA7 AT32_PINMUX_AF('A', 7, AF11)
#define EMAC_RMII_CRS_DV_PD8 AT32_PINMUX_AF('D', 8, AF11)

/* EMAC_RMII_REF_CLK */
#define EMAC_RMII_REF_CLK_PA1 AT32_PINMUX_AF('A', 1, AF11)

/* EMAC_RMII_RXD0 */
#define EMAC_RMII_RXD0_PC4 AT32_PINMUX_AF('C', 4, AF11)
#define EMAC_RMII_RXD0_PD9 AT32_PINMUX_AF('D', 9, AF11)

/* EMAC_RMII_RXD1 */
#define EMAC_RMII_RXD1_PC5 AT32_PINMUX_AF('C', 5, AF11)
#define EMAC_RMII_RXD1_PD10 AT32_PINMUX_AF('D', 10, AF11)

/* EMAC_RMII_TXD0 */
#define EMAC_RMII_TXD0_PB12 AT32_PINMUX_AF('B', 12, AF11)
#define EMAC_RMII_TXD0_PG13 AT32_PINMUX_AF('G', 13, AF11)

/* EMAC_RMII_TXD1 */
#define EMAC_RMII_TXD1_PB13 AT32_PINMUX_AF('B', 13, AF11)
#define EMAC_RMII_TXD1_PG14 AT32_PINMUX_AF('G', 14, AF11)

/* EMAC_RMII_TX_EN */
#define EMAC_RMII_TX_EN_PB11 AT32_PINMUX_AF('B', 11, AF11)
#define EMAC_RMII_TX_EN_PG11 AT32_PINMUX_AF('G', 11, AF11)

/* ERTC_REFIN */
#define ERTC_REFIN_PB15 AT32_PINMUX_AF('B', 15, AF0)

/* EVENTOUT */
#define EVENTOUT_PA0 AT32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 AT32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA10 AT32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 AT32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 AT32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 AT32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 AT32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 AT32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PA2 AT32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 AT32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 AT32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 AT32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 AT32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 AT32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 AT32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 AT32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PB0 AT32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 AT32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB10 AT32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 AT32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 AT32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 AT32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 AT32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 AT32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PB2 AT32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 AT32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 AT32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 AT32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 AT32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 AT32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 AT32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 AT32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PC0 AT32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 AT32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC10 AT32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 AT32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 AT32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 AT32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 AT32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 AT32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PC2 AT32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 AT32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 AT32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 AT32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 AT32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 AT32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 AT32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 AT32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PD0 AT32_PINMUX_AF('D', 0, AF15)
#define EVENTOUT_PD1 AT32_PINMUX_AF('D', 1, AF15)
#define EVENTOUT_PD10 AT32_PINMUX_AF('D', 10, AF15)
#define EVENTOUT_PD11 AT32_PINMUX_AF('D', 11, AF15)
#define EVENTOUT_PD12 AT32_PINMUX_AF('D', 12, AF15)
#define EVENTOUT_PD13 AT32_PINMUX_AF('D', 13, AF15)
#define EVENTOUT_PD14 AT32_PINMUX_AF('D', 14, AF15)
#define EVENTOUT_PD15 AT32_PINMUX_AF('D', 15, AF15)
#define EVENTOUT_PD2 AT32_PINMUX_AF('D', 2, AF15)
#define EVENTOUT_PD3 AT32_PINMUX_AF('D', 3, AF15)
#define EVENTOUT_PD4 AT32_PINMUX_AF('D', 4, AF15)
#define EVENTOUT_PD5 AT32_PINMUX_AF('D', 5, AF15)
#define EVENTOUT_PD6 AT32_PINMUX_AF('D', 6, AF15)
#define EVENTOUT_PD7 AT32_PINMUX_AF('D', 7, AF15)
#define EVENTOUT_PD8 AT32_PINMUX_AF('D', 8, AF15)
#define EVENTOUT_PD9 AT32_PINMUX_AF('D', 9, AF15)
#define EVENTOUT_PE0 AT32_PINMUX_AF('E', 0, AF15)
#define EVENTOUT_PE1 AT32_PINMUX_AF('E', 1, AF15)
#define EVENTOUT_PE10 AT32_PINMUX_AF('E', 10, AF15)
#define EVENTOUT_PE11 AT32_PINMUX_AF('E', 11, AF15)
#define EVENTOUT_PE12 AT32_PINMUX_AF('E', 12, AF15)
#define EVENTOUT_PE13 AT32_PINMUX_AF('E', 13, AF15)
#define EVENTOUT_PE14 AT32_PINMUX_AF('E', 14, AF15)
#define EVENTOUT_PE15 AT32_PINMUX_AF('E', 15, AF15)
#define EVENTOUT_PE2 AT32_PINMUX_AF('E', 2, AF15)
#define EVENTOUT_PE3 AT32_PINMUX_AF('E', 3, AF15)
#define EVENTOUT_PE4 AT32_PINMUX_AF('E', 4, AF15)
#define EVENTOUT_PE5 AT32_PINMUX_AF('E', 5, AF15)
#define EVENTOUT_PE6 AT32_PINMUX_AF('E', 6, AF15)
#define EVENTOUT_PE7 AT32_PINMUX_AF('E', 7, AF15)
#define EVENTOUT_PE8 AT32_PINMUX_AF('E', 8, AF15)
#define EVENTOUT_PE9 AT32_PINMUX_AF('E', 9, AF15)
#define EVENTOUT_PF0 AT32_PINMUX_AF('F', 0, AF15)
#define EVENTOUT_PF1 AT32_PINMUX_AF('F', 1, AF15)
#define EVENTOUT_PF10 AT32_PINMUX_AF('F', 10, AF15)
#define EVENTOUT_PF11 AT32_PINMUX_AF('F', 11, AF15)
#define EVENTOUT_PF12 AT32_PINMUX_AF('F', 12, AF15)
#define EVENTOUT_PF13 AT32_PINMUX_AF('F', 13, AF15)
#define EVENTOUT_PF14 AT32_PINMUX_AF('F', 14, AF15)
#define EVENTOUT_PF15 AT32_PINMUX_AF('F', 15, AF15)
#define EVENTOUT_PF2 AT32_PINMUX_AF('F', 2, AF15)
#define EVENTOUT_PF3 AT32_PINMUX_AF('F', 3, AF15)
#define EVENTOUT_PF4 AT32_PINMUX_AF('F', 4, AF15)
#define EVENTOUT_PF5 AT32_PINMUX_AF('F', 5, AF15)
#define EVENTOUT_PF6 AT32_PINMUX_AF('F', 6, AF15)
#define EVENTOUT_PF7 AT32_PINMUX_AF('F', 7, AF15)
#define EVENTOUT_PF8 AT32_PINMUX_AF('F', 8, AF15)
#define EVENTOUT_PF9 AT32_PINMUX_AF('F', 9, AF15)
#define EVENTOUT_PG0 AT32_PINMUX_AF('G', 0, AF15)
#define EVENTOUT_PG1 AT32_PINMUX_AF('G', 1, AF15)
#define EVENTOUT_PG10 AT32_PINMUX_AF('G', 10, AF15)
#define EVENTOUT_PG11 AT32_PINMUX_AF('G', 11, AF15)
#define EVENTOUT_PG12 AT32_PINMUX_AF('G', 12, AF15)
#define EVENTOUT_PG13 AT32_PINMUX_AF('G', 13, AF15)
#define EVENTOUT_PG14 AT32_PINMUX_AF('G', 14, AF15)
#define EVENTOUT_PG15 AT32_PINMUX_AF('G', 15, AF15)
#define EVENTOUT_PG2 AT32_PINMUX_AF('G', 2, AF15)
#define EVENTOUT_PG3 AT32_PINMUX_AF('G', 3, AF15)
#define EVENTOUT_PG4 AT32_PINMUX_AF('G', 4, AF15)
#define EVENTOUT_PG5 AT32_PINMUX_AF('G', 5, AF15)
#define EVENTOUT_PG6 AT32_PINMUX_AF('G', 6, AF15)
#define EVENTOUT_PG7 AT32_PINMUX_AF('G', 7, AF15)
#define EVENTOUT_PG8 AT32_PINMUX_AF('G', 8, AF15)
#define EVENTOUT_PG9 AT32_PINMUX_AF('G', 9, AF15)
#define EVENTOUT_PH0 AT32_PINMUX_AF('H', 0, AF15)
#define EVENTOUT_PH1 AT32_PINMUX_AF('H', 1, AF15)
#define EVENTOUT_PH2 AT32_PINMUX_AF('H', 2, AF15)
#define EVENTOUT_PH3 AT32_PINMUX_AF('H', 3, AF15)

/* I2C1_SCL */
#define I2C1_SCL_PA9 AT32_PINMUX_AF('A', 9, AF8)
#define I2C1_SCL_PB6 AT32_PINMUX_AF('B', 6, AF4)
#define I2C1_SCL_PB8 AT32_PINMUX_AF('B', 8, AF4)
#define I2C1_SCL_PC6 AT32_PINMUX_AF('C', 6, AF4)
#define I2C1_SCL_PH1 AT32_PINMUX_AF('H', 1, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PA10 AT32_PINMUX_AF('A', 10, AF8)
#define I2C1_SDA_PB7 AT32_PINMUX_AF('B', 7, AF4)
#define I2C1_SDA_PB9 AT32_PINMUX_AF('B', 9, AF4)
#define I2C1_SDA_PC7 AT32_PINMUX_AF('C', 7, AF4)
#define I2C1_SDA_PH0 AT32_PINMUX_AF('H', 0, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB5 AT32_PINMUX_AF('B', 5, AF4)
#define I2C1_SMBA_PC5 AT32_PINMUX_AF('C', 5, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA0 AT32_PINMUX_AF('A', 0, AF4)
#define I2C2_SCL_PA11 AT32_PINMUX_AF('A', 11, AF4)
#define I2C2_SCL_PB10 AT32_PINMUX_AF('B', 10, AF4)
#define I2C2_SCL_PD12 AT32_PINMUX_AF('D', 12, AF4)
#define I2C2_SCL_PF1 AT32_PINMUX_AF('F', 1, AF4)
#define I2C2_SCL_PH2 AT32_PINMUX_AF('H', 2, AF4)

