feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* OTG2_OE */
#define OTG2_OE_PC9 AT32_PINMUX_AF('C', 9, AF11)

/* OTG2_SOF */
#define OTG2_SOF_PA4 AT32_PINMUX_AF('A', 4, AF12)

/* OTG2_VBUS */
#define OTG2_VBUS_PB13 AT32_PINMUX_AF('B', 13, AF12)

/* QSPI1_CS */
#define QSPI1_CS_PB10 AT32_PINMUX_AF('B', 10, AF9)
#define QSPI1_CS_PB6 AT32_PINMUX_AF('B', 6, AF10)
#define QSPI1_CS_PB9 AT32_PINMUX_AF('B', 9, AF10)
#define QSPI1_CS_PC11 AT32_PINMUX_AF('C', 11, AF9)
#define QSPI1_CS_PG6 AT32_PINMUX_AF('G', 6, AF10)

/* QSPI1_IO0 */
#define QSPI1_IO0_PA6 AT32_PINMUX_AF('A', 6, AF10)
#define QSPI1_IO0_PB0 AT32_PINMUX_AF('B', 0, AF10)
#define QSPI1_IO0_PB11 AT32_PINMUX_AF('B', 11, AF10)
#define QSPI1_IO0_PC9 AT32_PINMUX_AF('C', 9, AF9)
#define QSPI1_IO0_PD11 AT32_PINMUX_AF('D', 11, AF9)
#define QSPI1_IO0_PF8 AT32_PINMUX_AF('F', 8, AF10)
#define QSPI1_IO0_PH2 AT32_PINMUX_AF('H', 2, AF10)

/* QSPI1_IO1 */
#define QSPI1_IO1_PA7 AT32_PINMUX_AF('A', 7, AF10)
#define QSPI1_IO1_PB10 AT32_PINMUX_AF('B', 10, AF10)
#define QSPI1_IO1_PC10 AT32_PINMUX_AF('C', 10, AF9)
#define QSPI1_IO1_PD12 AT32_PINMUX_AF('D', 12, AF9)
#define QSPI1_IO1_PH3 AT32_PINMUX_AF('H', 3, AF10)

/* QSPI1_IO2 */
#define QSPI1_IO2_PA15 AT32_PINMUX_AF('A', 15, AF10)
#define QSPI1_IO2_PC4 AT32_PINMUX_AF('C', 4, AF10)
#define QSPI1_IO2_PC8 AT32_PINMUX_AF('C', 8, AF9)
#define QSPI1_IO2_PE2 AT32_PINMUX_AF('E', 2, AF9)
#define QSPI1_IO2_PF7 AT32_PINMUX_AF('F', 7, AF9)
#define QSPI1_IO2_PG9 AT32_PINMUX_AF('G', 9, AF9)

/* QSPI1_IO3 */
#define QSPI1_IO3_PA1 AT32_PINMUX_AF('A', 1, AF9)
#define QSPI1_IO3_PB3 AT32_PINMUX_AF('B', 3, AF10)
#define QSPI1_IO3_PC5 AT32_PINMUX_AF('C', 5, AF10)
#define QSPI1_IO3_PD13 AT32_PINMUX_AF('D', 13, AF9)
#define QSPI1_IO3_PF6 AT32_PINMUX_AF('F', 6, AF9)
#define QSPI1_IO3_PG14 AT32_PINMUX_AF('G', 14, AF9)

/* QSPI1_MOSI_IO1 */
#define QSPI1_MOSI_IO1_PF9 AT32_PINMUX_AF('F', 9, AF10)

/* QSPI1_SCK */
#define QSPI1_SCK_PB1 AT32_PINMUX_AF('B', 1, AF9)
#define QSPI1_SCK_PB2 AT32_PINMUX_AF('B', 2, AF9)
#define QSPI1_SCK_PD3 AT32_PINMUX_AF('D', 3, AF9)
#define QSPI1_SCK_PF10 AT32_PINMUX_AF('F', 10, AF9)

/* QSPI2_CS */
#define QSPI2_CS_PB8 AT32_PINMUX_AF('B', 8, AF10)
#define QSPI2_CS_PG8 AT32_PINMUX_AF('G', 8, AF5)

/* QSPI2_IO0 */
#define QSPI2_IO0_PB0 AT32_PINMUX_AF('B', 0, AF9)
#define QSPI2_IO0_PE7 AT32_PINMUX_AF('E', 7, AF10)
#define QSPI2_IO0_PG14 AT32_PINMUX_AF('G', 14, AF5)

/* QSPI2_IO1 */
#define QSPI2_IO1_PA15 AT32_PINMUX_AF('A', 15, AF9)
#define QSPI2_IO1_PB7 AT32_PINMUX_AF('B', 7, AF9)
#define QSPI2_IO1_PC3 AT32_PINMUX_AF('C', 3, AF9)
#define QSPI2_IO1_PE8 AT32_PINMUX_AF('E', 8, AF10)
#define QSPI2_IO1_PG12 AT32_PINMUX_AF('G', 12, AF5)

/* QSPI2_IO2 */
#define QSPI2_IO2_PA5 AT32_PINMUX_AF('A', 5, AF9)
#define QSPI2_IO2_PE9 AT32_PINMUX_AF('E', 9, AF10)
#define QSPI2_IO2_PG10 AT32_PINMUX_AF('G', 10, AF5)

/* QSPI2_IO3 */
#define QSPI2_IO3_PA3 AT32_PINMUX_AF('A', 3, AF9)
#define QSPI2_IO3_PE10 AT32_PINMUX_AF('E', 10, AF10)
#define QSPI2_IO3_PG11 AT32_PINMUX_AF('G', 11, AF5)

/* QSPI2_SCK */
#define QSPI2_SCK_PB1 AT32_PINMUX_AF('B', 1, AF10)
#define QSPI2_SCK_PG13 AT32_PINMUX_AF('G', 13, AF5)

/* SDIO1_CK */
#define SDIO1_CK_PB15 AT32_PINMUX_AF('B', 15, AF13)
#define SDIO1_CK_PB2 AT32_PINMUX_AF('B', 2, AF12)
#define SDIO1_CK_PC12 AT32_PINMUX_AF('C', 12, AF12)

/* SDIO1_CMD */
#define SDIO1_CMD_PA6 AT32_PINMUX_AF('A', 6, AF12)
#define SDIO1_CMD_PD2 AT32_PINMUX_AF('D', 2, AF12)

/* SDIO1_D0 */
#define SDIO1_D0_PB4 AT32_PINMUX_AF('B', 4, AF12)
#define SDIO1_D0_PB6 AT32_PINMUX_AF('B', 6, AF14)
#define SDIO1_D0_PB7 AT32_PINMUX_AF('B', 7, AF14)
#define SDIO1_D0_PC8 AT32_PINMUX_AF('C', 8, AF12)

/* SDIO1_D1 */
#define SDIO1_D1_PA8 AT32_PINMUX_AF('A', 8, AF12)
#define SDIO1_D1_PB0 AT32_PINMUX_AF('B', 0, AF12)
#define SDIO1_D1_PC9 AT32_PINMUX_AF('C', 9, AF12)

/* SDIO1_D2 */
#define SDIO1_D2_PA9 AT32_PINMUX_AF('A', 9, AF12)
#define SDIO1_D2_PB1 AT32_PINMUX_AF('B', 1, AF12)
#define SDIO1_D2_PC10 AT32_PINMUX_AF('C', 10, AF12)

/* SDIO1_D3 */
#define SDIO1_D3_PB5 AT32_PINMUX_AF('B', 5, AF14)
#define SDIO1_D3_PC11 AT32_PINMUX_AF('C', 11, AF12)

/* SDIO1_D4 */
#define SDIO1_D4_PB8 AT32_PINMUX_AF('B', 8, AF12)

/* SDIO1_D5 */
#define SDIO1_D5_PB9 AT32_PINMUX_AF('B', 9, AF12)

/* SDIO1_D6 */
#define SDIO1_D6_PB14 AT32_PINMUX_AF('B', 14, AF13)
#define SDIO1_D6_PC6 AT32_PINMUX_AF('C', 6, AF12)

/* SDIO1_D7 */
#define SDIO1_D7_PB10 AT32_PINMUX_AF('B', 10, AF12)
#define SDIO1_D7_PC7 AT32_PINMUX_AF('C', 7, AF12)

/* SDIO2_CK */
#define SDIO2_CK_PA2 AT32_PINMUX_AF('A', 2, AF10)
#define SDIO2_CK_PC4 AT32_PINMUX_AF('C', 4, AF13)

/* SDIO2_CMD */
#define SDIO2_CMD_PA3 AT32_PINMUX_AF('A', 3, AF10)
#define SDIO2_CMD_PC5 AT32_PINMUX_AF('C', 5, AF13)

/* SDIO2_D0 */
#define SDIO2_D0_PA4 AT32_PINMUX_AF('A', 4, AF11)
#define SDIO2_D0_PC0 AT32_PINMUX_AF('C', 0, AF10)

/* SDIO2_D1 */
#define SDIO2_D1_PA5 AT32_PINMUX_AF('A', 5, AF11)
#define SDIO2_D1_PC1 AT32_PINMUX_AF('C', 1, AF10)

/* SDIO2_D2 */
#define SDIO2_D2_PA6 AT32_PINMUX_AF('A', 6, AF11)
#define SDIO2_D2_PC2 AT32_PINMUX_AF('C', 2, AF10)

/* SDIO2_D3 */
#define SDIO2_D3_PA7 AT32_PINMUX_AF('A', 7, AF13)
#define SDIO2_D3_PC3 AT32_PINMUX_AF('C', 3, AF10)

/* SDIO2_D4 */
#define SDIO2_D4_PA4 AT32_PINMUX_AF('A', 4, AF10)

/* SDIO2_D5 */
#define SDIO2_D5_PA5 AT32_PINMUX_AF('A', 5, AF10)

/* SDIO2_D6 */
#define SDIO2_D6_PA6 AT32_PINMUX_AF('A', 6, AF14)

/* SDIO2_D7 */
#define SDIO2_D7_PA7 AT32_PINMUX_AF('A', 7, AF14)

/* SPI1_CS */
#define SPI1_CS_PA15 AT32_PINMUX_AF('A', 15, AF5)
#define SPI1_CS_PA4 AT32_PINMUX_AF('A', 4, AF5)
#define SPI1_CS_PE12 AT32_PINMUX_AF('E', 12, AF4)

/* SPI1_MISO */
#define SPI1_MISO_PA6 AT32_PINMUX_AF('A', 6, AF5)
#define SPI1_MISO_PB4 AT32_PINMUX_AF('B', 4, AF5)
#define SPI1_MISO_PE14 AT32_PINMUX_AF('E', 14, AF4)
#define SPI1_MISO_PG0 AT32_PINMUX_AF('G', 0, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA7 AT32_PINMUX_AF('A', 7, AF5)
#define SPI1_MOSI_PB5 AT32_PINMUX_AF('B', 5, AF5)
#define SPI1_MOSI_PE15 AT32_PINMUX_AF('E', 15, AF4)
#define SPI1_MOSI_PG1 AT32_PINMUX_AF('G', 1, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA5 AT32_PINMUX_AF('A', 5, AF5)
#define SPI1_SCK_PB3 AT32_PINMUX_AF('B', 3, AF5)
#define SPI1_SCK_PE13 AT32_PINMUX_AF('E', 13, AF4)

/* SPI2_CS */
#define SPI2_CS_PA11 AT32_PINMUX_AF('A', 11, AF5)
#define SPI2_CS_PB12 AT32_PINMUX_AF('B', 12, AF5)
#define SPI2_CS_PB9 AT32_PINMUX_AF('B', 9, AF5)
#define SPI2_CS_PD0 AT32_PINMUX_AF('D', 0, AF7)
#define SPI2_CS_PD1 AT32_PINMUX_AF('D', 1, AF7)

/* SPI2_MISO */
#define SPI2_MISO_PA12 AT32_PINMUX_AF('A', 12, AF5)
#define SPI2_MISO_PB14 AT32_PINMUX_AF('B', 14, AF5)
#define SPI2_MISO_PC2 AT32_PINMUX_AF('C', 2, AF5)
#define SPI2_MISO_PD3 AT32_PINMUX_AF('D', 3, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PA10 AT32_PINMUX_AF('A', 10, AF5)
#define SPI2_MOSI_PB15 AT32_PINMUX_AF('B', 15, AF5)
#define SPI2_MOSI_PC1 AT32_PINMUX_AF('C', 1, AF7)
#define SPI2_MOSI_PC3 AT32_PINMUX_AF('C', 3, AF5)
#define SPI2_MOSI_PD4 AT32_PINMUX_AF('D', 4, AF6)

