feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* SPI2_SCK */
#define SPI2_SCK_PA9 AT32_PINMUX_AF('A', 9, AF5)
#define SPI2_SCK_PB1 AT32_PINMUX_AF('B', 1, AF6)
#define SPI2_SCK_PB10 AT32_PINMUX_AF('B', 10, AF5)
#define SPI2_SCK_PB13 AT32_PINMUX_AF('B', 13, AF5)
#define SPI2_SCK_PC7 AT32_PINMUX_AF('C', 7, AF5)
#define SPI2_SCK_PD1 AT32_PINMUX_AF('D', 1, AF6)
#define SPI2_SCK_PD3 AT32_PINMUX_AF('D', 3, AF5)

/* SPI3_CS */
#define SPI3_CS_PA15 AT32_PINMUX_AF('A', 15, AF6)
#define SPI3_CS_PA4 AT32_PINMUX_AF('A', 4, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA13 AT32_PINMUX_AF('A', 13, AF6)
#define SPI3_MISO_PB4 AT32_PINMUX_AF('B', 4, AF6)
#define SPI3_MISO_PC11 AT32_PINMUX_AF('C', 11, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA14 AT32_PINMUX_AF('A', 14, AF6)
#define SPI3_MOSI_PB0 AT32_PINMUX_AF('B', 0, AF7)
#define SPI3_MOSI_PB2 AT32_PINMUX_AF('B', 2, AF7)
#define SPI3_MOSI_PB5 AT32_PINMUX_AF('B', 5, AF6)
#define SPI3_MOSI_PC1 AT32_PINMUX_AF('C', 1, AF5)
#define SPI3_MOSI_PC12 AT32_PINMUX_AF('C', 12, AF6)
#define SPI3_MOSI_PD0 AT32_PINMUX_AF('D', 0, AF6)
#define SPI3_MOSI_PD6 AT32_PINMUX_AF('D', 6, AF5)

/* SPI3_SCK */
#define SPI3_SCK_PB12 AT32_PINMUX_AF('B', 12, AF7)
#define SPI3_SCK_PB3 AT32_PINMUX_AF('B', 3, AF6)
#define SPI3_SCK_PC10 AT32_PINMUX_AF('C', 10, AF6)

/* SPI4_CS */
#define SPI4_CS_PB12 AT32_PINMUX_AF('B', 12, AF6)
#define SPI4_CS_PB6 AT32_PINMUX_AF('B', 6, AF6)
#define SPI4_CS_PE11 AT32_PINMUX_AF('E', 11, AF5)
#define SPI4_CS_PE4 AT32_PINMUX_AF('E', 4, AF5)
#define SPI4_CS_PG14 AT32_PINMUX_AF('G', 14, AF6)

/* SPI4_MISO */
#define SPI4_MISO_PA11 AT32_PINMUX_AF('A', 11, AF6)
#define SPI4_MISO_PB8 AT32_PINMUX_AF('B', 8, AF6)
#define SPI4_MISO_PD0 AT32_PINMUX_AF('D', 0, AF5)
#define SPI4_MISO_PE13 AT32_PINMUX_AF('E', 13, AF5)
#define SPI4_MISO_PE5 AT32_PINMUX_AF('E', 5, AF5)
#define SPI4_MISO_PG12 AT32_PINMUX_AF('G', 12, AF6)

/* SPI4_MOSI */
#define SPI4_MOSI_PA1 AT32_PINMUX_AF('A', 1, AF5)
#define SPI4_MOSI_PB9 AT32_PINMUX_AF('B', 9, AF6)
#define SPI4_MOSI_PE14 AT32_PINMUX_AF('E', 14, AF5)
#define SPI4_MOSI_PE6 AT32_PINMUX_AF('E', 6, AF5)
#define SPI4_MOSI_PG13 AT32_PINMUX_AF('G', 13, AF6)

/* SPI4_SCK */
#define SPI4_SCK_PB13 AT32_PINMUX_AF('B', 13, AF6)
#define SPI4_SCK_PB7 AT32_PINMUX_AF('B', 7, AF6)
#define SPI4_SCK_PE12 AT32_PINMUX_AF('E', 12, AF5)
#define SPI4_SCK_PE2 AT32_PINMUX_AF('E', 2, AF5)
#define SPI4_SCK_PG11 AT32_PINMUX_AF('G', 11, AF6)

/* SWCLK */
#define SWCLK_PA14 AT32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 AT32_PINMUX_AF('A', 13, AF0)

/* SWO */
#define SWO_PB3 AT32_PINMUX_AF('B', 3, AF0)

/* TMR10_CH1 */
#define TMR10_CH1_PB8 AT32_PINMUX_AF('B', 8, AF3)
#define TMR10_CH1_PF6 AT32_PINMUX_AF('F', 6, AF3)

/* TMR11_CH1 */
#define TMR11_CH1_PB9 AT32_PINMUX_AF('B', 9, AF3)
#define TMR11_CH1_PC12 AT32_PINMUX_AF('C', 12, AF3)
#define TMR11_CH1_PF7 AT32_PINMUX_AF('F', 7, AF3)

/* TMR12_CH1 */
#define TMR12_CH1_PB14 AT32_PINMUX_AF('B', 14, AF9)

/* TMR12_CH2 */
#define TMR12_CH2_PB15 AT32_PINMUX_AF('B', 15, AF9)

/* TMR13_CH1 */
#define TMR13_CH1_PA6 AT32_PINMUX_AF('A', 6, AF9)
#define TMR13_CH1_PF8 AT32_PINMUX_AF('F', 8, AF9)

/* TMR14_CH1 */
#define TMR14_CH1_PA7 AT32_PINMUX_AF('A', 7, AF9)
#define TMR14_CH1_PF9 AT32_PINMUX_AF('F', 9, AF9)

/* TMR1_BRK */
#define TMR1_BRK_PA6 AT32_PINMUX_AF('A', 6, AF1)
#define TMR1_BRK_PB12 AT32_PINMUX_AF('B', 12, AF1)
#define TMR1_BRK_PE15 AT32_PINMUX_AF('E', 15, AF1)

/* TMR1_CH1 */
#define TMR1_CH1_PA8 AT32_PINMUX_AF('A', 8, AF1)
#define TMR1_CH1_PE9 AT32_PINMUX_AF('E', 9, AF1)

/* TMR1_CH1C */
#define TMR1_CH1C_PA7 AT32_PINMUX_AF('A', 7, AF1)
#define TMR1_CH1C_PB13 AT32_PINMUX_AF('B', 13, AF1)
#define TMR1_CH1C_PE8 AT32_PINMUX_AF('E', 8, AF1)

/* TMR1_CH2 */
#define TMR1_CH2_PA9 AT32_PINMUX_AF('A', 9, AF1)
#define TMR1_CH2_PE11 AT32_PINMUX_AF('E', 11, AF1)

/* TMR1_CH2C */
#define TMR1_CH2C_PB0 AT32_PINMUX_AF('B', 0, AF1)
#define TMR1_CH2C_PB14 AT32_PINMUX_AF('B', 14, AF1)
#define TMR1_CH2C_PE1 AT32_PINMUX_AF('E', 1, AF1)
#define TMR1_CH2C_PE10 AT32_PINMUX_AF('E', 10, AF1)

/* TMR1_CH3 */
#define TMR1_CH3_PA10 AT32_PINMUX_AF('A', 10, AF1)
#define TMR1_CH3_PE13 AT32_PINMUX_AF('E', 13, AF1)

/* TMR1_CH3C */
#define TMR1_CH3C_PB1 AT32_PINMUX_AF('B', 1, AF1)
#define TMR1_CH3C_PB15 AT32_PINMUX_AF('B', 15, AF1)
#define TMR1_CH3C_PE12 AT32_PINMUX_AF('E', 12, AF1)

/* TMR1_CH4 */
#define TMR1_CH4_PA11 AT32_PINMUX_AF('A', 11, AF1)
#define TMR1_CH4_PE14 AT32_PINMUX_AF('E', 14, AF1)

/* TMR1_EXT */
#define TMR1_EXT_PA12 AT32_PINMUX_AF('A', 12, AF1)
#define TMR1_EXT_PE7 AT32_PINMUX_AF('E', 7, AF1)
#define TMR1_EXT_PF10 AT32_PINMUX_AF('F', 10, AF1)

/* TMR20_BRK */
#define TMR20_BRK_PF7 AT32_PINMUX_AF('F', 7, AF2)
#define TMR20_BRK_PF9 AT32_PINMUX_AF('F', 9, AF2)
#define TMR20_BRK_PG3 AT32_PINMUX_AF('G', 3, AF2)

/* TMR20_CH1 */
#define TMR20_CH1_PB2 AT32_PINMUX_AF('B', 2, AF2)
#define TMR20_CH1_PE2 AT32_PINMUX_AF('E', 2, AF6)
#define TMR20_CH1_PF12 AT32_PINMUX_AF('F', 12, AF2)

/* TMR20_CH1C */
#define TMR20_CH1C_PE4 AT32_PINMUX_AF('E', 4, AF6)
#define TMR20_CH1C_PF4 AT32_PINMUX_AF('F', 4, AF2)
#define TMR20_CH1C_PG0 AT32_PINMUX_AF('G', 0, AF2)

/* TMR20_CH2 */
#define TMR20_CH2_PC2 AT32_PINMUX_AF('C', 2, AF2)
#define TMR20_CH2_PE3 AT32_PINMUX_AF('E', 3, AF6)
#define TMR20_CH2_PF13 AT32_PINMUX_AF('F', 13, AF2)

/* TMR20_CH2C */
#define TMR20_CH2C_PE5 AT32_PINMUX_AF('E', 5, AF6)
#define TMR20_CH2C_PF5 AT32_PINMUX_AF('F', 5, AF2)
#define TMR20_CH2C_PG1 AT32_PINMUX_AF('G', 1, AF2)

/* TMR20_CH3 */
#define TMR20_CH3_PC8 AT32_PINMUX_AF('C', 8, AF6)
#define TMR20_CH3_PF14 AT32_PINMUX_AF('F', 14, AF2)
#define TMR20_CH3_PF2 AT32_PINMUX_AF('F', 2, AF2)

/* TMR20_CH3C */
#define TMR20_CH3C_PE6 AT32_PINMUX_AF('E', 6, AF6)
#define TMR20_CH3C_PG2 AT32_PINMUX_AF('G', 2, AF2)

/* TMR20_CH4 */
#define TMR20_CH4_PE1 AT32_PINMUX_AF('E', 1, AF6)
#define TMR20_CH4_PF15 AT32_PINMUX_AF('F', 15, AF2)
#define TMR20_CH4_PF3 AT32_PINMUX_AF('F', 3, AF2)
#define TMR20_CH4_PF6 AT32_PINMUX_AF('F', 6, AF2)

/* TMR20_EXT */
#define TMR20_EXT_PE0 AT32_PINMUX_AF('E', 0, AF6)
#define TMR20_EXT_PF11 AT32_PINMUX_AF('F', 11, AF2)
#define TMR20_EXT_PG5 AT32_PINMUX_AF('G', 5, AF2)

/* TMR2_CH1 */
#define TMR2_CH1_PA0 AT32_PINMUX_AF('A', 0, AF1)
#define TMR2_CH1_PA15 AT32_PINMUX_AF('A', 15, AF1)
#define TMR2_CH1_PA5 AT32_PINMUX_AF('A', 5, AF1)
#define TMR2_CH1_PB8 AT32_PINMUX_AF('B', 8, AF1)

/* TMR2_CH2 */
#define TMR2_CH2_PA1 AT32_PINMUX_AF('A', 1, AF1)
#define TMR2_CH2_PB3 AT32_PINMUX_AF('B', 3, AF1)
#define TMR2_CH2_PB9 AT32_PINMUX_AF('B', 9, AF1)

/* TMR2_CH3 */
#define TMR2_CH3_PA2 AT32_PINMUX_AF('A', 2, AF1)
#define TMR2_CH3_PB10 AT32_PINMUX_AF('B', 10, AF1)

/* TMR2_CH4 */
#define TMR2_CH4_PA3 AT32_PINMUX_AF('A', 3, AF1)
#define TMR2_CH4_PB11 AT32_PINMUX_AF('B', 11, AF1)
#define TMR2_CH4_PB2 AT32_PINMUX_AF('B', 2, AF1)

/* TMR2_EXT */
#define TMR2_EXT_PA0 AT32_PINMUX_AF('A', 0, AF1)
#define TMR2_EXT_PA15 AT32_PINMUX_AF('A', 15, AF1)
#define TMR2_EXT_PA5 AT32_PINMUX_AF('A', 5, AF1)
#define TMR2_EXT_PB8 AT32_PINMUX_AF('B', 8, AF1)

/* TMR3_CH1 */
#define TMR3_CH1_PA6 AT32_PINMUX_AF('A', 6, AF2)
#define TMR3_CH1_PB4 AT32_PINMUX_AF('B', 4, AF2)
#define TMR3_CH1_PC6 AT32_PINMUX_AF('C', 6, AF2)
#define TMR3_CH1_PE3 AT32_PINMUX_AF('E', 3, AF2)

/* TMR3_CH2 */
#define TMR3_CH2_PA7 AT32_PINMUX_AF('A', 7, AF2)
#define TMR3_CH2_PB5 AT32_PINMUX_AF('B', 5, AF2)
#define TMR3_CH2_PC7 AT32_PINMUX_AF('C', 7, AF2)
#define TMR3_CH2_PE4 AT32_PINMUX_AF('E', 4, AF2)

