feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* TMR3_CH3 */
#define TMR3_CH3_PB0 AT32_PINMUX_AF('B', 0, AF2)
#define TMR3_CH3_PC8 AT32_PINMUX_AF('C', 8, AF2)
#define TMR3_CH3_PE5 AT32_PINMUX_AF('E', 5, AF2)

/* TMR3_CH4 */
#define TMR3_CH4_PB1 AT32_PINMUX_AF('B', 1, AF2)
#define TMR3_CH4_PC9 AT32_PINMUX_AF('C', 9, AF2)
#define TMR3_CH4_PE6 AT32_PINMUX_AF('E', 6, AF2)

/* TMR3_EXT */
#define TMR3_EXT_PD2 AT32_PINMUX_AF('D', 2, AF2)
#define TMR3_EXT_PE2 AT32_PINMUX_AF('E', 2, AF2)

/* TMR4_CH1 */
#define TMR4_CH1_PB6 AT32_PINMUX_AF('B', 6, AF2)
#define TMR4_CH1_PD12 AT32_PINMUX_AF('D', 12, AF2)

/* TMR4_CH2 */
#define TMR4_CH2_PB7 AT32_PINMUX_AF('B', 7, AF2)
#define TMR4_CH2_PD13 AT32_PINMUX_AF('D', 13, AF2)

/* TMR4_CH3 */
#define TMR4_CH3_PB8 AT32_PINMUX_AF('B', 8, AF2)
#define TMR4_CH3_PD14 AT32_PINMUX_AF('D', 14, AF2)

/* TMR4_CH4 */
#define TMR4_CH4_PB9 AT32_PINMUX_AF('B', 9, AF2)
#define TMR4_CH4_PD15 AT32_PINMUX_AF('D', 15, AF2)

/* TMR4_EXT */
#define TMR4_EXT_PE0 AT32_PINMUX_AF('E', 0, AF2)

/* TMR5_CH1 */
#define TMR5_CH1_PA0 AT32_PINMUX_AF('A', 0, AF2)
#define TMR5_CH1_PB12 AT32_PINMUX_AF('B', 12, AF2)
#define TMR5_CH1_PH2 AT32_PINMUX_AF('H', 2, AF2)

/* TMR5_CH2 */
#define TMR5_CH2_PA1 AT32_PINMUX_AF('A', 1, AF2)
#define TMR5_CH2_PC10 AT32_PINMUX_AF('C', 10, AF2)
#define TMR5_CH2_PH3 AT32_PINMUX_AF('H', 3, AF2)

/* TMR5_CH3 */
#define TMR5_CH3_PA2 AT32_PINMUX_AF('A', 2, AF2)
#define TMR5_CH3_PC11 AT32_PINMUX_AF('C', 11, AF2)

/* TMR5_CH4 */
#define TMR5_CH4_PA3 AT32_PINMUX_AF('A', 3, AF2)
#define TMR5_CH4_PB11 AT32_PINMUX_AF('B', 11, AF2)
#define TMR5_CH4_PF10 AT32_PINMUX_AF('F', 10, AF2)

/* TMR8_BRK */
#define TMR8_BRK_PA6 AT32_PINMUX_AF('A', 6, AF3)
#define TMR8_BRK_PB7 AT32_PINMUX_AF('B', 7, AF3)
#define TMR8_BRK_PF12 AT32_PINMUX_AF('F', 12, AF3)

/* TMR8_CH1 */
#define TMR8_CH1_PC6 AT32_PINMUX_AF('C', 6, AF3)

/* TMR8_CH1C */
#define TMR8_CH1C_PA5 AT32_PINMUX_AF('A', 5, AF3)
#define TMR8_CH1C_PA7 AT32_PINMUX_AF('A', 7, AF3)

/* TMR8_CH2 */
#define TMR8_CH2_PC7 AT32_PINMUX_AF('C', 7, AF3)

/* TMR8_CH2C */
#define TMR8_CH2C_PB0 AT32_PINMUX_AF('B', 0, AF3)
#define TMR8_CH2C_PB14 AT32_PINMUX_AF('B', 14, AF3)

/* TMR8_CH3 */
#define TMR8_CH3_PC8 AT32_PINMUX_AF('C', 8, AF3)

/* TMR8_CH3C */
#define TMR8_CH3C_PB1 AT32_PINMUX_AF('B', 1, AF3)
#define TMR8_CH3C_PB15 AT32_PINMUX_AF('B', 15, AF3)

/* TMR8_CH4 */
#define TMR8_CH4_PC9 AT32_PINMUX_AF('C', 9, AF3)

/* TMR8_EXT */
#define TMR8_EXT_PA0 AT32_PINMUX_AF('A', 0, AF3)
#define TMR8_EXT_PF11 AT32_PINMUX_AF('F', 11, AF3)

/* TMR9_CH1 */
#define TMR9_CH1_PA2 AT32_PINMUX_AF('A', 2, AF3)
#define TMR9_CH1_PC4 AT32_PINMUX_AF('C', 4, AF3)
#define TMR9_CH1_PE5 AT32_PINMUX_AF('E', 5, AF3)

/* TMR9_CH2 */
#define TMR9_CH2_PA3 AT32_PINMUX_AF('A', 3, AF3)
#define TMR9_CH2_PC5 AT32_PINMUX_AF('C', 5, AF3)
#define TMR9_CH2_PE6 AT32_PINMUX_AF('E', 6, AF3)

/* UART4_RX */
#define UART4_RX_PA1 AT32_PINMUX_AF('A', 1, AF8)
#define UART4_RX_PC11 AT32_PINMUX_AF('C', 11, AF8)
#define UART4_RX_PE9 AT32_PINMUX_AF('E', 9, AF7)
#define UART4_RX_PH2 AT32_PINMUX_AF('H', 2, AF8)

/* UART4_TX */
#define UART4_TX_PA0 AT32_PINMUX_AF('A', 0, AF8)
#define UART4_TX_PC10 AT32_PINMUX_AF('C', 10, AF8)
#define UART4_TX_PE8 AT32_PINMUX_AF('E', 8, AF7)
#define UART4_TX_PH3 AT32_PINMUX_AF('H', 3, AF8)

/* UART5_RX */
#define UART5_RX_PB5 AT32_PINMUX_AF('B', 5, AF8)
#define UART5_RX_PB8 AT32_PINMUX_AF('B', 8, AF8)
#define UART5_RX_PD2 AT32_PINMUX_AF('D', 2, AF8)
#define UART5_RX_PE11 AT32_PINMUX_AF('E', 11, AF8)

/* UART5_TX */
#define UART5_TX_PB6 AT32_PINMUX_AF('B', 6, AF8)
#define UART5_TX_PB9 AT32_PINMUX_AF('B', 9, AF8)
#define UART5_TX_PC12 AT32_PINMUX_AF('C', 12, AF8)
#define UART5_TX_PE10 AT32_PINMUX_AF('E', 10, AF8)

/* UART7_RX */
#define UART7_RX_PB3 AT32_PINMUX_AF('B', 3, AF8)
#define UART7_RX_PC1 AT32_PINMUX_AF('C', 1, AF8)
#define UART7_RX_PE7 AT32_PINMUX_AF('E', 7, AF8)
#define UART7_RX_PF6 AT32_PINMUX_AF('F', 6, AF8)

/* UART7_TX */
#define UART7_TX_PB4 AT32_PINMUX_AF('B', 4, AF8)
#define UART7_TX_PC0 AT32_PINMUX_AF('C', 0, AF8)
#define UART7_TX_PE8 AT32_PINMUX_AF('E', 8, AF8)
#define UART7_TX_PF7 AT32_PINMUX_AF('F', 7, AF8)

/* UART8_RX */
#define UART8_RX_PC3 AT32_PINMUX_AF('C', 3, AF8)
#define UART8_RX_PC9 AT32_PINMUX_AF('C', 9, AF7)
#define UART8_RX_PD14 AT32_PINMUX_AF('D', 14, AF8)
#define UART8_RX_PE0 AT32_PINMUX_AF('E', 0, AF8)

/* UART8_TX */
#define UART8_TX_PC2 AT32_PINMUX_AF('C', 2, AF8)
#define UART8_TX_PC8 AT32_PINMUX_AF('C', 8, AF7)
#define UART8_TX_PD13 AT32_PINMUX_AF('D', 13, AF8)
#define UART8_TX_PE1 AT32_PINMUX_AF('E', 1, AF8)

/* USART1_CK */
#define USART1_CK_PA8 AT32_PINMUX_AF('A', 8, AF7)
#define USART1_CK_PB5 AT32_PINMUX_AF('B', 5, AF7)

/* USART1_CTS */
#define USART1_CTS_PA11 AT32_PINMUX_AF('A', 11, AF7)

/* USART1_RTS_DE */
#define USART1_RTS_DE_PA12 AT32_PINMUX_AF('A', 12, AF7)

/* USART1_RX */
#define USART1_RX_PA10 AT32_PINMUX_AF('A', 10, AF7)
#define USART1_RX_PB3 AT32_PINMUX_AF('B', 3, AF7)
#define USART1_RX_PB7 AT32_PINMUX_AF('B', 7, AF7)

/* USART1_TX */
#define USART1_TX_PA15 AT32_PINMUX_AF('A', 15, AF7)
#define USART1_TX_PA9 AT32_PINMUX_AF('A', 9, AF7)
#define USART1_TX_PB6 AT32_PINMUX_AF('B', 6, AF7)

/* USART2_CK */
#define USART2_CK_PA4 AT32_PINMUX_AF('A', 4, AF7)
#define USART2_CK_PD7 AT32_PINMUX_AF('D', 7, AF7)

/* USART2_CTS */
#define USART2_CTS_PA0 AT32_PINMUX_AF('A', 0, AF7)
#define USART2_CTS_PD3 AT32_PINMUX_AF('D', 3, AF7)

/* USART2_RTS_DE */
#define USART2_RTS_DE_PA1 AT32_PINMUX_AF('A', 1, AF7)
#define USART2_RTS_DE_PD4 AT32_PINMUX_AF('D', 4, AF7)

/* USART2_RX */
#define USART2_RX_PA15 AT32_PINMUX_AF('A', 15, AF8)
#define USART2_RX_PA3 AT32_PINMUX_AF('A', 3, AF7)
#define USART2_RX_PB0 AT32_PINMUX_AF('B', 0, AF6)
#define USART2_RX_PD6 AT32_PINMUX_AF('D', 6, AF7)

/* USART2_TX */
#define USART2_TX_PA14 AT32_PINMUX_AF('A', 14, AF8)
#define USART2_TX_PA2 AT32_PINMUX_AF('A', 2, AF7)
#define USART2_TX_PA8 AT32_PINMUX_AF('A', 8, AF8)
#define USART2_TX_PD5 AT32_PINMUX_AF('D', 5, AF7)

/* USART3_CK */
#define USART3_CK_PB0 AT32_PINMUX_AF('B', 0, AF8)
#define USART3_CK_PB12 AT32_PINMUX_AF('B', 12, AF8)
#define USART3_CK_PC12 AT32_PINMUX_AF('C', 12, AF7)
#define USART3_CK_PD10 AT32_PINMUX_AF('D', 10, AF7)

