feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* USART3_CTS */
#define USART3_CTS_PA6 AT32_PINMUX_AF('A', 6, AF7)
#define USART3_CTS_PB13 AT32_PINMUX_AF('B', 13, AF8)
#define USART3_CTS_PD11 AT32_PINMUX_AF('D', 11, AF7)

/* USART3_RTS_DE */
#define USART3_RTS_DE_PB1 AT32_PINMUX_AF('B', 1, AF8)
#define USART3_RTS_DE_PB14 AT32_PINMUX_AF('B', 14, AF7)
#define USART3_RTS_DE_PD12 AT32_PINMUX_AF('D', 12, AF7)
#define USART3_RTS_DE_PD2 AT32_PINMUX_AF('D', 2, AF7)

/* USART3_RX */
#define USART3_RX_PB11 AT32_PINMUX_AF('B', 11, AF7)
#define USART3_RX_PC11 AT32_PINMUX_AF('C', 11, AF7)
#define USART3_RX_PC5 AT32_PINMUX_AF('C', 5, AF7)
#define USART3_RX_PD9 AT32_PINMUX_AF('D', 9, AF7)

/* USART3_TX */
#define USART3_TX_PB10 AT32_PINMUX_AF('B', 10, AF7)
#define USART3_TX_PC10 AT32_PINMUX_AF('C', 10, AF7)
#define USART3_TX_PC4 AT32_PINMUX_AF('C', 4, AF7)
#define USART3_TX_PD8 AT32_PINMUX_AF('D', 8, AF7)

/* USART6_CK */
#define USART6_CK_PC8 AT32_PINMUX_AF('C', 8, AF8)
#define USART6_CK_PG7 AT32_PINMUX_AF('G', 7, AF8)

/* USART6_CTS */
#define USART6_CTS_PG13 AT32_PINMUX_AF('G', 13, AF8)
#define USART6_CTS_PG15 AT32_PINMUX_AF('G', 15, AF8)

/* USART6_RTS_DE */
#define USART6_RTS_DE_PG12 AT32_PINMUX_AF('G', 12, AF8)
#define USART6_RTS_DE_PG8 AT32_PINMUX_AF('G', 8, AF8)

/* USART6_RX */
#define USART6_RX_PA12 AT32_PINMUX_AF('A', 12, AF8)
#define USART6_RX_PA5 AT32_PINMUX_AF('A', 5, AF8)
#define USART6_RX_PC7 AT32_PINMUX_AF('C', 7, AF8)
#define USART6_RX_PG9 AT32_PINMUX_AF('G', 9, AF8)

/* USART6_TX */
#define USART6_TX_PA11 AT32_PINMUX_AF('A', 11, AF8)
#define USART6_TX_PA4 AT32_PINMUX_AF('A', 4, AF8)
#define USART6_TX_PC6 AT32_PINMUX_AF('C', 6, AF8)
#define USART6_TX_PG14 AT32_PINMUX_AF('G', 14, AF8)

/* XMCALE */
#define XMCALE_PD12 AT32_PINMUX_AF('D', 12, AF12)

/* XMCCLE */
#define XMCCLE_PD11 AT32_PINMUX_AF('D', 11, AF12)

/* XMC_A0 */
#define XMC_A0_PC3 AT32_PINMUX_AF('C', 3, AF14)
#define XMC_A0_PC6 AT32_PINMUX_AF('C', 6, AF10)
#define XMC_A0_PF0 AT32_PINMUX_AF('F', 0, AF12)

/* XMC_A1 */
#define XMC_A1_PC7 AT32_PINMUX_AF('C', 7, AF10)
#define XMC_A1_PF1 AT32_PINMUX_AF('F', 1, AF12)

/* XMC_A10 */
#define XMC_A10_PD5 AT32_PINMUX_AF('D', 5, AF10)
#define XMC_A10_PG0 AT32_PINMUX_AF('G', 0, AF12)

/* XMC_A11 */
#define XMC_A11_PD6 AT32_PINMUX_AF('D', 6, AF10)
#define XMC_A11_PG1 AT32_PINMUX_AF('G', 1, AF12)

/* XMC_A12 */
#define XMC_A12_PD7 AT32_PINMUX_AF('D', 7, AF10)
#define XMC_A12_PG2 AT32_PINMUX_AF('G', 2, AF12)

/* XMC_A13 */
#define XMC_A13_PG3 AT32_PINMUX_AF('G', 3, AF12)

/* XMC_A14 */
#define XMC_A14_PD11 AT32_PINMUX_AF('D', 11, AF10)
#define XMC_A14_PG4 AT32_PINMUX_AF('G', 4, AF12)

/* XMC_A15 */
#define XMC_A15_PD12 AT32_PINMUX_AF('D', 12, AF10)
#define XMC_A15_PG5 AT32_PINMUX_AF('G', 5, AF12)

/* XMC_A16 */
#define XMC_A16_PD11 AT32_PINMUX_AF('D', 11, AF12)

/* XMC_A17 */
#define XMC_A17_PD12 AT32_PINMUX_AF('D', 12, AF12)

/* XMC_A18 */
#define XMC_A18_PD13 AT32_PINMUX_AF('D', 13, AF12)

/* XMC_A19 */
#define XMC_A19_PE3 AT32_PINMUX_AF('E', 3, AF12)

/* XMC_A2 */
#define XMC_A2_PC8 AT32_PINMUX_AF('C', 8, AF10)
#define XMC_A2_PF2 AT32_PINMUX_AF('F', 2, AF12)

/* XMC_A20 */
#define XMC_A20_PE4 AT32_PINMUX_AF('E', 4, AF12)

/* XMC_A21 */
#define XMC_A21_PE5 AT32_PINMUX_AF('E', 5, AF12)

/* XMC_A22 */
#define XMC_A22_PE6 AT32_PINMUX_AF('E', 6, AF12)

/* XMC_A23 */
#define XMC_A23_PE2 AT32_PINMUX_AF('E', 2, AF12)

/* XMC_A24 */
#define XMC_A24_PG13 AT32_PINMUX_AF('G', 13, AF12)

/* XMC_A25 */
#define XMC_A25_PG14 AT32_PINMUX_AF('G', 14, AF12)

/* XMC_A3 */
#define XMC_A3_PC9 AT32_PINMUX_AF('C', 9, AF10)
#define XMC_A3_PF3 AT32_PINMUX_AF('F', 3, AF12)

/* XMC_A4 */
#define XMC_A4_PA8 AT32_PINMUX_AF('A', 8, AF14)
#define XMC_A4_PF4 AT32_PINMUX_AF('F', 4, AF12)

/* XMC_A5 */
#define XMC_A5_PD0 AT32_PINMUX_AF('D', 0, AF10)
#define XMC_A5_PF5 AT32_PINMUX_AF('F', 5, AF12)

/* XMC_A6 */
#define XMC_A6_PD1 AT32_PINMUX_AF('D', 1, AF10)
#define XMC_A6_PF12 AT32_PINMUX_AF('F', 12, AF12)

/* XMC_A7 */
#define XMC_A7_PD2 AT32_PINMUX_AF('D', 2, AF10)
#define XMC_A7_PF13 AT32_PINMUX_AF('F', 13, AF12)

/* XMC_A8 */
#define XMC_A8_PD3 AT32_PINMUX_AF('D', 3, AF10)
#define XMC_A8_PF14 AT32_PINMUX_AF('F', 14, AF12)

/* XMC_A9 */
#define XMC_A9_PD4 AT32_PINMUX_AF('D', 4, AF10)
#define XMC_A9_PF15 AT32_PINMUX_AF('F', 15, AF12)

/* XMC_CD */
#define XMC_CD_PF9 AT32_PINMUX_AF('F', 9, AF12)

/* XMC_CLK */
#define XMC_CLK_PD3 AT32_PINMUX_AF('D', 3, AF12)

/* XMC_D0 */
#define XMC_D0_PB14 AT32_PINMUX_AF('B', 14, AF14)
#define XMC_D0_PD14 AT32_PINMUX_AF('D', 14, AF12)

/* XMC_D1 */
#define XMC_D1_PC6 AT32_PINMUX_AF('C', 6, AF14)
#define XMC_D1_PD15 AT32_PINMUX_AF('D', 15, AF12)

/* XMC_D10 */
#define XMC_D10_PE13 AT32_PINMUX_AF('E', 13, AF12)

/* XMC_D11 */
#define XMC_D11_PE14 AT32_PINMUX_AF('E', 14, AF12)

/* XMC_D12 */
#define XMC_D12_PE15 AT32_PINMUX_AF('E', 15, AF12)

/* XMC_D13 */
#define XMC_D13_PB12 AT32_PINMUX_AF('B', 12, AF14)
#define XMC_D13_PD8 AT32_PINMUX_AF('D', 8, AF12)

/* XMC_D14 */
#define XMC_D14_PD9 AT32_PINMUX_AF('D', 9, AF12)

/* XMC_D15 */
#define XMC_D15_PD10 AT32_PINMUX_AF('D', 10, AF12)

/* XMC_D2 */
#define XMC_D2_PC11 AT32_PINMUX_AF('C', 11, AF14)
#define XMC_D2_PD0 AT32_PINMUX_AF('D', 0, AF12)

/* XMC_D3 */
#define XMC_D3_PC12 AT32_PINMUX_AF('C', 12, AF14)
#define XMC_D3_PD1 AT32_PINMUX_AF('D', 1, AF12)

/* XMC_D4 */
#define XMC_D4_PA2 AT32_PINMUX_AF('A', 2, AF14)
#define XMC_D4_PE7 AT32_PINMUX_AF('E', 7, AF12)

/* XMC_D5 */
#define XMC_D5_PA3 AT32_PINMUX_AF('A', 3, AF14)
#define XMC_D5_PE8 AT32_PINMUX_AF('E', 8, AF12)

/* XMC_D6 */
#define XMC_D6_PA4 AT32_PINMUX_AF('A', 4, AF14)
#define XMC_D6_PE9 AT32_PINMUX_AF('E', 9, AF12)

/* XMC_D7 */
#define XMC_D7_PA5 AT32_PINMUX_AF('A', 5, AF14)
#define XMC_D7_PE10 AT32_PINMUX_AF('E', 10, AF12)

/* XMC_D8 */
#define XMC_D8_PE11 AT32_PINMUX_AF('E', 11, AF12)

/* XMC_D9 */
#define XMC_D9_PE12 AT32_PINMUX_AF('E', 12, AF12)

/* XMC_INT2 */
#define XMC_INT2_PG6 AT32_PINMUX_AF('G', 6, AF12)

/* XMC_INT3 */
#define XMC_INT3_PG7 AT32_PINMUX_AF('G', 7, AF12)

/* XMC_INTR */
#define XMC_INTR_PF10 AT32_PINMUX_AF('F', 10, AF12)

/* XMC_LB/XM */
#define XMC_LB / XM_PE0 AT32_PINMUX_AF('E', 0, AF12)

