feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437c(c-g-m)xx-pinctrl.h
/* XMC_NADV */
#define XMC_NADV_PB7 AT32_PINMUX_AF('B', 7, AF12)

/* XMC_NCE2 */
#define XMC_NCE2_PD7 AT32_PINMUX_AF('D', 7, AF12)

/* XMC_NCE3 */
#define XMC_NCE3_PA15 AT32_PINMUX_AF('A', 15, AF12)
#define XMC_NCE3_PG9 AT32_PINMUX_AF('G', 9, AF12)

/* XMC_NCE4_1 */
#define XMC_NCE4_1_PG10 AT32_PINMUX_AF('G', 10, AF12)

/* XMC_NCE4_2 */
#define XMC_NCE4_2_PG11 AT32_PINMUX_AF('G', 11, AF12)

/* XMC_NE1 */
#define XMC_NE1_PD7 AT32_PINMUX_AF('D', 7, AF12)

/* XMC_NE2 */
#define XMC_NE2_PA15 AT32_PINMUX_AF('A', 15, AF12)
#define XMC_NE2_PG9 AT32_PINMUX_AF('G', 9, AF12)

/* XMC_NE3 */
#define XMC_NE3_PG10 AT32_PINMUX_AF('G', 10, AF12)

/* XMC_NE4 */
#define XMC_NE4_PC4 AT32_PINMUX_AF('C', 4, AF14)
#define XMC_NE4_PG12 AT32_PINMUX_AF('G', 12, AF12)

/* XMC_NIORD */
#define XMC_NIORD_PF6 AT32_PINMUX_AF('F', 6, AF12)

/* XMC_NIOWR */
#define XMC_NIOWR_PF8 AT32_PINMUX_AF('F', 8, AF12)

/* XMC_NOE */
#define XMC_NOE_PB10 AT32_PINMUX_AF('B', 10, AF14)
#define XMC_NOE_PC5 AT32_PINMUX_AF('C', 5, AF14)
#define XMC_NOE_PD4 AT32_PINMUX_AF('D', 4, AF12)

/* XMC_NREG */
#define XMC_NREG_PF7 AT32_PINMUX_AF('F', 7, AF12)

/* XMC_NWAIT */
#define XMC_NWAIT_PD6 AT32_PINMUX_AF('D', 6, AF12)

/* XMC_NWE */
#define XMC_NWE_PC2 AT32_PINMUX_AF('C', 2, AF14)
#define XMC_NWE_PD2 AT32_PINMUX_AF('D', 2, AF14)
#define XMC_NWE_PD5 AT32_PINMUX_AF('D', 5, AF12)

/* XMC_SDBA0 */
#define XMC_SDBA0_PD11 AT32_PINMUX_AF('D', 11, AF10)
#define XMC_SDBA0_PG4 AT32_PINMUX_AF('G', 4, AF12)

/* XMC_SDBA1 */
#define XMC_SDBA1_PD12 AT32_PINMUX_AF('D', 12, AF10)
#define XMC_SDBA1_PG5 AT32_PINMUX_AF('G', 5, AF12)

/* XMC_SDCKE0 */
#define XMC_SDCKE0_PC3 AT32_PINMUX_AF('C', 3, AF12)
#define XMC_SDCKE0_PC5 AT32_PINMUX_AF('C', 5, AF12)

/* XMC_SDCKE1 */
#define XMC_SDCKE1_PB5 AT32_PINMUX_AF('B', 5, AF12)

/* XMC_SDCLK */
#define XMC_SDCLK_PG8 AT32_PINMUX_AF('G', 8, AF12)

/* XMC_SDCS0 */
#define XMC_SDCS0_PC2 AT32_PINMUX_AF('C', 2, AF12)
#define XMC_SDCS0_PC4 AT32_PINMUX_AF('C', 4, AF12)

/* XMC_SDCS1 */
#define XMC_SDCS1_PB6 AT32_PINMUX_AF('B', 6, AF12)

/* XMC_SDNCAS */
#define XMC_SDNCAS_PE2 AT32_PINMUX_AF('E', 2, AF10)
#define XMC_SDNCAS_PG15 AT32_PINMUX_AF('G', 15, AF12)

/* XMC_SDNRAS */
#define XMC_SDNRAS_PE6 AT32_PINMUX_AF('E', 6, AF10)
#define XMC_SDNRAS_PF11 AT32_PINMUX_AF('F', 11, AF12)

/* XMC_SDNWE */
#define XMC_SDNWE_PA7 AT32_PINMUX_AF('A', 7, AF12)
#define XMC_SDNWE_PC0 AT32_PINMUX_AF('C', 0, AF12)

/* XMC_SD_CLK */
#define XMC_SD_CLK_PD13 AT32_PINMUX_AF('D', 13, AF10)

/* XMC_UB/X */
#define XMC_UB / X_PE1 AT32_PINMUX_AF('E', 1, AF12)
